tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# Neovim
brew "llvm"
brew "lua-language-server"
brew "neovim"
brew "rust-analyzer"
brew "rg"
brew "tree-sitter"

# Build tools
brew "cmake"
brew "git"
brew "pkg-config"
brew "poetry"

# Programming tools
brew "arduino-cli"
brew "go"
cask "visual-studio-code"
cask "arduino"

# CLI utils
brew "watch"
brew "thefuck"
brew "tmux"

# GUI apps
cask "1password"
cask "blender"
cask "caffeine"
cask "dropbox"
cask "firefox"
cask "wezterm"
cask "obsidian"
cask "rectangle"
cask "karabiner-elements"
