tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# neovim
brew "llvm"
brew "lua-language-server"
brew "rg"

# build tools
brew "git"
brew "cmake"
brew "pkg-config"
brew "pyenv"
brew "pyenv-virtualenv"

# pyenv dependencies
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"
brew "tcl-tk"

# CLI utils
brew "watch"
brew "neovim"
brew "thefuck"
brew "tmux"

# GUI apps
cask "1password"
cask "blender"
cask "dropbox"
cask "firefox"
cask "iterm2"
cask "obsidian"
cask "rectangle"
cask "visual-studio-code"
cask "karabiner-elements"
