tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# language servers and linters
brew "clang-format"
brew "lua"
brew "lua-language-server"
brew "prettier"
brew "prettierd"
brew "pyright"
brew "rust-analyzer"
brew "shellharden"
brew "shfmt"
brew "stylua"
brew "tailwindcss-language-server"
brew "taplo"
brew "typescript-language-server"
brew "vscode-langservers-extracted"
brew "yamlfmt"

# Build tools
brew "cmake"
brew "git"
brew "llvm"
brew "pkg-config"
brew "poetry"

# version managers
brew "fnm"
brew "pyenv"

# Programming languages
brew "arduino-cli"
brew "go"
cask "arduino"

# CLI utils
brew "btop"
brew "curl"
brew "graphviz"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "neovim"
brew "nnn"
brew "rg"
brew "tmux"
brew "tree-sitter"
brew "watch"
brew "wget"

# GUI apps
cask "1password"
cask "blender"
cask "caffeine"
cask "dropbox"
cask "firefox"
cask "karabiner-elements"
cask "obsidian"
cask "rectangle"
cask "wezterm"
